words3  = { 
           1:'один',           2:'два',           3:'три',
           4:'четыре',         5:'пять',          6:'шесть',
           7:'семь',           8:'восемь',        9:'девять', 11 : 'одиннадцать', 12 : 'двенадцать', 13 : 'тринадцать',
    14 : 'четырнадцать', 15 : 'пятнадцать', 16 : 'шестнадцать',
    17 : 'семнадцать', 18 : 'восемнадцать', 19 : 'девятнадцать'
         }
words2  = { 0:'',
          1:'десять',
          2:'двадцать',     3:'тридцать',
          4:'сорок',         5:'пятьдесят',    6:'шестьдесят',
          7:'семьдесят',     8:'восемьдесят',  9:'девяносто' 
          }
words1  = { 
          1:'сто',
          2:'двести',     3:'триста',
          4:'четыреста',         5:'пятьсот',    6:'шестьсот',
          7:'семьсот',     8:'восемьсот',  9:'девятьсот' 
          }
          
number = int(input())
if number == 0: print('0')
elif 0 < number < 20: print(words3[number])
elif 20 < number < 100: print(words2[number // 10], words3[number % 10])
elif 100 < number < 1000: print(words1[number // 100], words2[number // 10 % 10], words3[number % 10])