from string import whitespace as space, punctuation as puncts
from pprint import *
text = """У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо — песнь заводит,
Налево — сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух… там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил."""


words = ''

for char in text.lower():
    if char not in puncts + '—…':
        if char in space:
            words += ' '
        else:
            words += char
            
words = set(text.lower()) - set(space + puncts + '—…')
result = {}
for word in words:
    result[word] = {}
    for char in text.split():
        len_char = len(char)
        if word in char:
            result[word][len_char] =  result[word].setdefault(len_char, 0) + 1
pprint(result)





# {'а': {2: 5, 3: 15, 4: 3, 5: 5, 6: 7, 7: 9, 8: 4, 9: 1, 10: 2},
 # 'б': {3: 4, 4: 3, 5: 2, 6: 2, 7: 3, 9: 1},
 # 'в': {1: 1, 3: 1, 4: 2, 5: 3, 6: 2, 7: 7, 8: 3, 9: 2, 10: 1},
 # 'г': {4: 2, 7: 1, 8: 3, 9: 1},
 # 'д': {3: 7, 4: 4, 5: 5, 6: 6, 7: 6, 8: 3, 9: 2, 10: 1},
 # 'е': {2: 1, 3: 4, 4: 5, 5: 11, 6: 5, 7: 10, 8: 3, 9: 2, 10: 2},
 # 'ж': {6: 2, 7: 1, 8: 1},
 # 'з': {2: 1, 3: 2, 4: 1, 5: 2, 6: 3, 7: 3, 8: 4},
 # 'и': {1: 5, 2: 2, 3: 1, 4: 4, 5: 4, 6: 5, 7: 6, 8: 4, 9: 3, 10: 1},
 # 'й': {2: 1, 4: 1, 5: 3, 6: 4, 7: 6, 8: 4},
 # 'к': {3: 2, 4: 1, 5: 1, 6: 5, 7: 5, 8: 2, 9: 2, 10: 1},
 # 'л': {3: 2, 4: 3, 5: 5, 6: 6, 7: 4, 8: 3, 9: 3},
 # 'м': {3: 17, 4: 6, 6: 1, 7: 3, 8: 1, 9: 3},
 # 'н': {2: 4, 3: 3, 4: 2, 5: 6, 6: 6, 7: 8, 8: 4, 9: 2, 10: 2},
 # 'о': {1: 1, 2: 1, 3: 5, 4: 6, 5: 7, 6: 7, 7: 7, 8: 6, 9: 5},
 # 'п': {2: 1, 4: 3, 5: 3, 6: 1, 7: 3, 8: 1, 9: 1, 10: 1},
 # 'р': {4: 5, 5: 6, 6: 3, 7: 8, 8: 6, 9: 4, 10: 1},
 # 'с': {1: 2, 3: 2, 4: 1, 5: 5, 6: 6, 7: 5, 8: 2, 10: 1},
 # 'т': {3: 7, 4: 2, 5: 5, 6: 6, 7: 9, 8: 3, 9: 2},
 # 'у': {3: 2, 4: 2, 5: 3, 6: 6, 7: 7, 9: 2},
 # 'х': {2: 1, 4: 1, 5: 1, 6: 4, 7: 4, 8: 1, 9: 3, 10: 2},
 # 'ц': {4: 3, 5: 1, 7: 2, 8: 1},
 # 'ч': {5: 2, 6: 2, 7: 2, 8: 1, 9: 1},
 # 'ш': {5: 1, 7: 1},
 # 'щ': {5: 1},
 # 'ы': {4: 1, 5: 3, 6: 4, 7: 1, 8: 3, 9: 3, 10: 2},
 # 'ь': {4: 2, 5: 3, 6: 2, 8: 1, 9: 1},
 # 'ю': {5: 3},
 # 'я': {1: 2, 4: 2, 5: 1, 6: 4, 7: 3, 9: 2},
 # 'ё': {3: 2, 4: 2, 5: 2, 6: 3, 8: 2}}